RobustoFramework/Robusto/examples/proxy/esp32_p4_c6_sdio/c6_delegate/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ROBUSTO_PEER_NAME="C6_DELEGATE"
CONFIG_ROBUSTO_PUBSUB_SERVER=y
CONFIG_ROBUSTO_PROXY=y
CONFIG_ROBUSTO_PROXY_SERVER=y
CONFIG_ROBUSTO_PROXY_SERVICE_PUBSUB=y
CONFIG_ROBUSTO_PROXY_PROFILE_LOW_MEMORY=y